In [1]:
import numpy as np
import pandas as pd
import os
import math
from numpy.random import randn
import matplotlib.pyplot as plt
%matplotlib inline

In [9]:
df=pd.DataFrame({'A':[1,2,3],'B':[4,np.nan,5],'C':[7,np.nan,np.nan]})
df['State']="AA hs fs".split()
df.set_index('State',inplace=True)
df

       A    B    C
State
AA     1  4.0  7.0
hs     2  NaN  NaN
fs     3  5.0  NaN

In [13]:
df.dropna(axis=0,thresh=1)

       A    B    C
State
AA     1  4.0  7.0
hs     2  NaN  NaN
fs     3  5.0  NaN

In [19]:
df.fillna(value=df['A'].mean())

       A    B    C
State
AA     1  4.0  7.0
hs     2  2.0  2.0
fs     3  5.0  2.0

In [41]:
data={'Company':['GG','GG','MM','MM','FB','FB'],'Person':['Sam','Charlie','rohn','john','DK','GM'],'Sales':[100,200,340,123,280,400]}
df=pd.DataFrame(data)
bycomp=df.groupby('Company')
bycomp.mean()
pd.DataFrame(bycomp.describe().loc['FB']).transpose()

   Sales
   count   mean        std    min    25%    50%    75%    max
FB   2.0  340.0  84.852814  280.0  310.0  340.0  370.0  400.0

In [59]:
df1=pd.DataFrame({'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'],'D':['D1','D2','D3','D4']},index=[0,1,2,3])

In [69]:
df2=pd.DataFrame({'A':['A5','A6','A7','A8'],'B':['B5','B6','B7','B8'],'C':['C5','C6','C7','C8'],'D':['D5','D6','D7','D8']},index=[4,5,6,7])

In [68]:
df3=pd.DataFrame({'A':['A9','A10','A11','A12'],'B':['B9','B10','B11','B12'],'C':['C9','C10','C11','C12'],'D':['D9','D10','D11','D12']},index=[8,9,10,11])

In [72]:
df_concat

      A    B    C    D
0    A1   B1   C1   D1
1    A2   B2   C2   D2
2    A3   B3   C3   D3
3    A4   B4   C4   D4
4    A5   B5   C5   D5
5    A6   B6   C6   D6
6    A7   B7   C7   D7
7    A8   B8   C8   D8
8    A9   B9   C9   D9
9   A10  B10  C10  D10
10  A11  B11  C11  D11
11  A12  B12  C12  D12

In [75]:
df_concat=pd.concat([df1,df2,df3],axis=1)
df_concat.fillna("*")

     A   B   C   D   A   B   C   D    A    B    C    D
0   A1  B1  C1  D1   *   *   *   *    *    *    *    *
1   A2  B2  C2  D2   *   *   *   *    *    *    *    *
2   A3  B3  C3  D3   *   *   *   *    *    *    *    *
3   A4  B4  C4  D4   *   *   *   *    *    *    *    *
4    *   *   *   *  A5  B5  C5  D5    *    *    *    *
5    *   *   *   *  A6  B6  C6  D6    *    *    *    *
6    *   *   *   *  A7  B7  C7  D7    *    *    *    *
7    *   *   *   *  A8  B8  C8  D8    *    *    *    *
8    *   *   *   *   *   *   *   *   A9   B9   C9   D9
9    *   *   *   *   *   *   *   *  A10  B10  C10  D10
10   *   *   *   *   *   *   *   *  A11  B11  C11  D11
11   *   *   *   *   *   *   *   *  A12  B12  C12  D12

In [158]:
left=pd.DataFrame({
                  'A':['a1','a2','a3'],
                  'B':['b1','b2','b3']},index=['k0','k1','k2'])
right=pd.DataFrame({
                  'C':['c1','c2','c3'],
                  'D':['d1','d2','d3']},index=['k0','k2','k3'])

left.join(right)

     A   B    C    D
k0  a1  b1   c1   d1
k1  a2  b2  NaN  NaN
k2  a3  b3   c2   d2

In [144]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                 'col2':[444,555,666,444,333,222,666,777,666,555],
                 'col3':'aaa bb c dddd eeee fff ggg h iii j'.split()})

In [145]:
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444  dddd
4     5   333  eeee
5     6   222   fff
6     7   666   ggg
7     8   777     h
8     9   666   iii
9    10   555     j

In [153]:
df['funcApplied']=df['col1'].apply(lambda x:x**2)

In [154]:
df

   col1  col2  col3  funcApplied
0     1   444   aaa            1
1     2   555    bb            4
2     3   666     c            9
3     4   444  dddd           16
4     5   333  eeee           25
5     6   222   fff           36
6     7   666   ggg           49
7     8   777     h           64
8     9   666   iii           81
9    10   555     j          100

In [180]:

df1=pd.DataFrame(randn(5,3),['A','B','C','D','E'],['X','Y','Z'])
df1[df1['Y']>0][['Y','Z']]

          Y         Z
B  1.987265 -0.573454
D  1.639065 -0.458803
E  0.480033 -1.321482

In [186]:
a=np.fromfunction(lambda i,j:i+j,(3,3),dtype=int).transpose
a

In [188]:
iterable=(x*x for x in range(5))
iterable

In [190]:
np.fromiter(iterable,dtype=int)

array([ 0,  1,  4,  9, 16])

In [191]:
np.arange(5)

array([0, 1, 2, 3, 4])

In [4]:
np.linspace(1,5,4,retstep=True)

(array([1.        , 2.33333333, 3.66666667, 5.        ]), 1.3333333333333333)

In [3]:
np.ones((5,2,8))

array([[[1., 1., 1., 1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1., 1., 1., 1.]],

       [[1., 1., 1., 1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1., 1., 1., 1.]],

       [[1., 1., 1., 1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1., 1., 1., 1.]],

       [[1., 1., 1., 1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1., 1., 1., 1.]],

       [[1., 1., 1., 1., 1., 1., 1., 1.],
        [1., 1., 1., 1., 1., 1., 1., 1.]]])

In [20]:
x=np.arange(25).reshape((5,-1))

In [30]:
np.diagflat([1,2],3)

array([[0, 0, 0, 1, 0],
       [0, 0, 0, 0, 2],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0]])

In [28]:
np.random.seed(10)
np.random.randn(2,3)

array([[ 1.3315865 ,  0.71527897, -1.54540029],
       [-0.00838385,  0.62133597, -0.72008556]])

In [29]:
a=np.random.randint(1,200,30).reshape(5,6)
a

array([[  1,  41, 165, 116,  17, 101],
       [140,  55,  89, 108, 123,  63],
       [ 34, 101, 178, 180,  55,  78],
       [198,  14, 154, 127, 142,  93],
       [ 87,  31, 159,  90, 141,  66]])

In [24]:
a.argmax(axis=0)

array([2, 2, 3, 1, 2, 0], dtype=int64)